entregaClse32/artillery-cluster-console.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 50,
      "vusers.created": 50,
      "http.requests": 1000,
      "http.codes.200": 1000,
      "http.responses": 1000,
      "vusers.failed": 0,
      "vusers.completed": 50
    },
    "rates": {
      "http.request_rate": 992
    },
    "firstCounterAt": 1671583418018,
    "firstHistogramAt": 1671583418048,
    "lastCounterAt": 1671583419038,
    "lastHistogramAt": 1671583419038,
    "firstMetricAt": 1671583418018,
    "lastMetricAt": 1671583419038,
    "period": 1671583410000,
    "summaries": {
      "http.response_time": {
        "min": 0,
        "max": 34,
        "count": 1000,
        "p50": 3,
        "median": 3,
        "p75": 5,
        "p90": 7.9,
        "p95": 8.9,
        "p99": 13.9,
        "p999": 34.1
      },
      "vusers.session_length": {
        "min": 41.1,
        "max": 213.3,
        "count": 50,
        "p50": 106.7,
        "median": 106.7,
        "p75": 115.6,
        "p90": 144,
        "p95": 165.7,
        "p99": 194.4,
        "p999": 194.4
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 0,
        "max": 34,
        "count": 1000,
        "p50": 3,
        "median": 3,
        "p75": 5,
        "p90": 7.9,
        "p95": 8.9,
        "p99": 13.9,
        "p999": 34.1
      },
      "vusers.session_length": {
        "min": 41.1,
        "max": 213.3,
        "count": 50,
        "p50": 106.7,
        "median": 106.7,
        "p75": 115.6,
        "p90": 144,
        "p95": 165.7,
        "p99": 194.4,
        "p999": 194.4
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 50,
        "vusers.created": 50,
        "http.requests": 1000,
        "http.codes.200": 1000,
        "http.responses": 1000,
        "vusers.failed": 0,
        "vusers.completed": 50
      },
      "rates": {
        "http.request_rate": 992
      },
      "http.request_rate": null,
      "firstCounterAt": 1671583418018,
      "firstHistogramAt": 1671583418048,
      "lastCounterAt": 1671583419038,
      "lastHistogramAt": 1671583419038,
      "firstMetricAt": 1671583418018,
      "lastMetricAt": 1671583419038,
      "period": "1671583410000",
      "summaries": {
        "http.response_time": {
          "min": 0,
          "max": 34,
          "count": 1000,
          "p50": 3,
          "median": 3,
          "p75": 5,
          "p90": 7.9,
          "p95": 8.9,
          "p99": 13.9,
          "p999": 34.1
        },
        "vusers.session_length": {
          "min": 41.1,
          "max": 213.3,
          "count": 50,
          "p50": 106.7,
          "median": 106.7,
          "p75": 115.6,
          "p90": 144,
          "p95": 165.7,
          "p99": 194.4,
          "p999": 194.4
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 0,
          "max": 34,
          "count": 1000,
          "p50": 3,
          "median": 3,
          "p75": 5,
          "p90": 7.9,
          "p95": 8.9,
          "p99": 13.9,
          "p999": 34.1
        },
        "vusers.session_length": {
          "min": 41.1,
          "max": 213.3,
          "count": 50,
          "p50": 106.7,
          "median": 106.7,
          "p75": 115.6,
          "p90": 144,
          "p95": 165.7,
          "p99": 194.4,
          "p999": 194.4
        }
      }
    }
  ]
}