entregaClse32/artillery-cluster.txt
{
  "aggregate": {
    "counters": {
      "http.requests": 1000,
      "http.codes.200": 1000,
      "http.responses": 1000,
      "vusers.created_by_name.0": 50,
      "vusers.created": 50,
      "vusers.failed": 0,
      "vusers.completed": 50
    },
    "rates": {
      "http.request_rate": 500
    },
    "firstCounterAt": 1671583369960,
    "firstHistogramAt": 1671583369979,
    "lastCounterAt": 1671583370978,
    "lastHistogramAt": 1671583370978,
    "firstMetricAt": 1671583369960,
    "lastMetricAt": 1671583370978,
    "period": 1671583370000,
    "summaries": {
      "http.response_time": {
        "min": 0,
        "max": 33,
        "count": 1000,
        "p50": 3,
        "median": 3,
        "p75": 4,
        "p90": 6,
        "p95": 7.9,
        "p99": 13.1,
        "p999": 29.1
      },
      "vusers.session_length": {
        "min": 30.8,
        "max": 146,
        "count": 50,
        "p50": 94.6,
        "median": 94.6,
        "p75": 113.3,
        "p90": 141.2,
        "p95": 141.2,
        "p99": 144,
        "p999": 144
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 0,
        "max": 33,
        "count": 1000,
        "p50": 3,
        "median": 3,
        "p75": 4,
        "p90": 6,
        "p95": 7.9,
        "p99": 13.1,
        "p999": 29.1
      },
      "vusers.session_length": {
        "min": 30.8,
        "max": 146,
        "count": 50,
        "p50": 94.6,
        "median": 94.6,
        "p75": 113.3,
        "p90": 141.2,
        "p95": 141.2,
        "p99": 144,
        "p999": 144
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 3,
        "vusers.created": 3,
        "http.requests": 10,
        "http.codes.200": 8,
        "http.responses": 8
      },
      "rates": {
        "http.request_rate": 10
      },
      "http.request_rate": null,
      "firstCounterAt": 1671583369960,
      "firstHistogramAt": 1671583369979,
      "lastCounterAt": 1671583369999,
      "lastHistogramAt": 1671583369997,
      "firstMetricAt": 1671583369960,
      "lastMetricAt": 1671583369999,
      "period": "1671583360000",
      "summaries": {
        "http.response_time": {
          "min": 1,
          "max": 3,
          "count": 8,
          "p50": 2,
          "median": 2,
          "p75": 3,
          "p90": 3,
          "p95": 3,
          "p99": 3,
          "p999": 3
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 1,
          "max": 3,
          "count": 8,
          "p50": 2,
          "median": 2,
          "p75": 3,
          "p90": 3,
          "p95": 3,
          "p99": 3,
          "p999": 3
        }
      }
    },
    {
      "counters": {
        "http.requests": 990,
        "http.codes.200": 992,
        "http.responses": 992,
        "vusers.created_by_name.0": 47,
        "vusers.created": 47,
        "vusers.failed": 0,
        "vusers.completed": 50
      },
      "rates": {
        "http.request_rate": 990
      },
      "http.request_rate": null,
      "firstCounterAt": 1671583370001,
      "firstHistogramAt": 1671583370002,
      "lastCounterAt": 1671583370978,
      "lastHistogramAt": 1671583370978,
      "firstMetricAt": 1671583370001,
      "lastMetricAt": 1671583370978,
      "period": "1671583370000",
      "summaries": {
        "http.response_time": {
          "min": 0,
          "max": 33,
          "count": 992,
          "p50": 3,
          "median": 3,
          "p75": 4,
          "p90": 6,
          "p95": 7.9,
          "p99": 13.1,
          "p999": 29.1
        },
        "vusers.session_length": {
          "min": 30.8,
          "max": 146,
          "count": 50,
          "p50": 94.6,
          "median": 94.6,
          "p75": 113.3,
          "p90": 141.2,
          "p95": 141.2,
          "p99": 144,
          "p999": 144
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 0,
          "max": 33,
          "count": 992,
          "p50": 3,
          "median": 3,
          "p75": 4,
          "p90": 6,
          "p95": 7.9,
          "p99": 13.1,
          "p999": 29.1
        },
        "vusers.session_length": {
          "min": 30.8,
          "max": 146,
          "count": 50,
          "p50": 94.6,
          "median": 94.6,
          "p75": 113.3,
          "p90": 141.2,
          "p95": 141.2,
          "p99": 144,
          "p999": 144
        }
      }
    }
  ]
}