entregaClse32/artillery-fork-console.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 50,
      "vusers.created": 50,
      "http.requests": 1000,
      "http.codes.200": 1000,
      "http.responses": 1000,
      "vusers.failed": 0,
      "vusers.completed": 50
    },
    "rates": {
      "http.request_rate": 951
    },
    "firstCounterAt": 1671572052615,
    "firstHistogramAt": 1671572052644,
    "lastCounterAt": 1671572053680,
    "lastHistogramAt": 1671572053680,
    "firstMetricAt": 1671572052615,
    "lastMetricAt": 1671572053680,
    "period": 1671572050000,
    "summaries": {
      "http.response_time": {
        "min": 1,
        "max": 26,
        "count": 1000,
        "p50": 6,
        "median": 6,
        "p75": 7,
        "p90": 10.1,
        "p95": 10.9,
        "p99": 18,
        "p999": 25.8
      },
      "vusers.session_length": {
        "min": 86.7,
        "max": 189.6,
        "count": 50,
        "p50": 147,
        "median": 147,
        "p75": 162.4,
        "p90": 175.9,
        "p95": 183.1,
        "p99": 183.1,
        "p999": 183.1
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 1,
        "max": 26,
        "count": 1000,
        "p50": 6,
        "median": 6,
        "p75": 7,
        "p90": 10.1,
        "p95": 10.9,
        "p99": 18,
        "p999": 25.8
      },
      "vusers.session_length": {
        "min": 86.7,
        "max": 189.6,
        "count": 50,
        "p50": 147,
        "median": 147,
        "p75": 162.4,
        "p90": 175.9,
        "p95": 183.1,
        "p99": 183.1,
        "p999": 183.1
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 50,
        "vusers.created": 50,
        "http.requests": 1000,
        "http.codes.200": 1000,
        "http.responses": 1000,
        "vusers.failed": 0,
        "vusers.completed": 50
      },
      "rates": {
        "http.request_rate": 951
      },
      "http.request_rate": null,
      "firstCounterAt": 1671572052615,
      "firstHistogramAt": 1671572052644,
      "lastCounterAt": 1671572053680,
      "lastHistogramAt": 1671572053680,
      "firstMetricAt": 1671572052615,
      "lastMetricAt": 1671572053680,
      "period": "1671572050000",
      "summaries": {
        "http.response_time": {
          "min": 1,
          "max": 26,
          "count": 1000,
          "p50": 6,
          "median": 6,
          "p75": 7,
          "p90": 10.1,
          "p95": 10.9,
          "p99": 18,
          "p999": 25.8
        },
        "vusers.session_length": {
          "min": 86.7,
          "max": 189.6,
          "count": 50,
          "p50": 147,
          "median": 147,
          "p75": 162.4,
          "p90": 175.9,
          "p95": 183.1,
          "p99": 183.1,
          "p999": 183.1
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 1,
          "max": 26,
          "count": 1000,
          "p50": 6,
          "median": 6,
          "p75": 7,
          "p90": 10.1,
          "p95": 10.9,
          "p99": 18,
          "p999": 25.8
        },
        "vusers.session_length": {
          "min": 86.7,
          "max": 189.6,
          "count": 50,
          "p50": 147,
          "median": 147,
          "p75": 162.4,
          "p90": 175.9,
          "p95": 183.1,
          "p99": 183.1,
          "p999": 183.1
        }
      }
    }
  ]
}