entregaClse32/artillery-fork.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 50,
      "vusers.created": 50,
      "http.requests": 1000,
      "http.codes.200": 1000,
      "http.responses": 1000,
      "vusers.failed": 0,
      "vusers.completed": 50
    },
    "rates": {
      "http.request_rate": 980
    },
    "firstCounterAt": 1671572188394,
    "firstHistogramAt": 1671572188433,
    "lastCounterAt": 1671572189427,
    "lastHistogramAt": 1671572189427,
    "firstMetricAt": 1671572188394,
    "lastMetricAt": 1671572189427,
    "period": 1671572180000,
    "summaries": {
      "http.response_time": {
        "min": 1,
        "max": 23,
        "count": 1000,
        "p50": 5,
        "median": 5,
        "p75": 7,
        "p90": 10.1,
        "p95": 13.1,
        "p99": 16.9,
        "p999": 18
      },
      "vusers.session_length": {
        "min": 54.4,
        "max": 190.6,
        "count": 50,
        "p50": 141.2,
        "median": 141.2,
        "p75": 162.4,
        "p90": 172.5,
        "p95": 183.1,
        "p99": 190.6,
        "p999": 190.6
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 1,
        "max": 23,
        "count": 1000,
        "p50": 5,
        "median": 5,
        "p75": 7,
        "p90": 10.1,
        "p95": 13.1,
        "p99": 16.9,
        "p999": 18
      },
      "vusers.session_length": {
        "min": 54.4,
        "max": 190.6,
        "count": 50,
        "p50": 141.2,
        "median": 141.2,
        "p75": 162.4,
        "p90": 172.5,
        "p95": 183.1,
        "p99": 190.6,
        "p999": 190.6
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 50,
        "vusers.created": 50,
        "http.requests": 1000,
        "http.codes.200": 1000,
        "http.responses": 1000,
        "vusers.failed": 0,
        "vusers.completed": 50
      },
      "rates": {
        "http.request_rate": 980
      },
      "http.request_rate": null,
      "firstCounterAt": 1671572188394,
      "firstHistogramAt": 1671572188433,
      "lastCounterAt": 1671572189427,
      "lastHistogramAt": 1671572189427,
      "firstMetricAt": 1671572188394,
      "lastMetricAt": 1671572189427,
      "period": "1671572180000",
      "summaries": {
        "http.response_time": {
          "min": 1,
          "max": 23,
          "count": 1000,
          "p50": 5,
          "median": 5,
          "p75": 7,
          "p90": 10.1,
          "p95": 13.1,
          "p99": 16.9,
          "p999": 18
        },
        "vusers.session_length": {
          "min": 54.4,
          "max": 190.6,
          "count": 50,
          "p50": 141.2,
          "median": 141.2,
          "p75": 162.4,
          "p90": 172.5,
          "p95": 183.1,
          "p99": 190.6,
          "p999": 190.6
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 1,
          "max": 23,
          "count": 1000,
          "p50": 5,
          "median": 5,
          "p75": 7,
          "p90": 10.1,
          "p95": 13.1,
          "p99": 16.9,
          "p999": 18
        },
        "vusers.session_length": {
          "min": 54.4,
          "max": 190.6,
          "count": 50,
          "p50": 141.2,
          "median": 141.2,
          "p75": 162.4,
          "p90": 172.5,
          "p95": 183.1,
          "p99": 190.6,
          "p999": 190.6
        }
      }
    }
  ]
}